Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Adjunciones (WIP)                                                                      :post:
:PROPERTIES:
:TITLE: Adjunciones (WIP)
:EXPORT_FILE_NAME: sobreadjunciones.html
:EXPORT_DATE: 21 de abril de 2019
:INDEX_DATE: <2019-04-21 Sun>
:EXPORT_OPTIONS: toc:1 num:t lang:es
:END:

/Este es un post en construcción que me gustaría expandir./
/No es una prioridad ahora mismo y no sé cuánto me llevará escribirlo./

*Introducción.* Las *adjunciones* son un concepto básico que no suele
aparecer en cursos de matemáticas hasta que se empieza a usar teoría
de categorías.  Muchas construcciones pueden expresarse como
adjunciones, y saber identificarlas y usarlas simplifica muchos
razonamientos.  La mayoría de estas notas vienen de traducir partes de
mi trabajo de fin de grado, pero pueden encontrarse (y bastante mejor
explicadas) en cualquier libro básico de teoría de categorías (/Awodey/,
/Riehl/ o /MacLane/), quizá con otra notación.  Especialmente la notación
como secuentes en lógica viene inspirada por teoría de tipos y no
parece especialmente común, pero aquí la usaremos en la mayoría de
demostraciones.

