sobreadjunciones.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-03 Wed 13:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Adjunciones (WIP)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Adjunciones (WIP)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3342258">1. Adjunciones</a></li>
</ul>
</div>
</div>
<p>
<i>Este es un post en construcción que me gustaría expandir.</i>
<i>No es una prioridad ahora mismo y no sé cuánto me llevará escribirlo.</i>
</p>

<p>
<b>Introducción.</b> Las <b>adjunciones</b> son un concepto básico que no suele
aparecer en cursos de matemáticas hasta que se empieza a usar teoría
de categorías.  Muchas construcciones pueden expresarse como
adjunciones, y saber identificarlas y usarlas simplifica muchos
razonamientos.  La mayoría de estas notas vienen de traducir partes de
mi trabajo de fin de grado, pero pueden encontrarse (y bastante mejor
explicadas) en cualquier libro básico de teoría de categorías (<i>Awodey</i>,
<i>Riehl</i> o <i>MacLane</i>), quizá con otra notación.  Especialmente la notación
como secuentes en lógica viene inspirada por teoría de tipos y no
parece especialmente común, pero aquí la usaremos en la mayoría de
demostraciones.
</p>
