Blog.org
** Adjunciones
*Definición.* Una *adjunción* entre dos categorías *X* e *Y* es un par de
funtores F : *X* -> *Y* y G : *Y* -> *X*, junto a una biyección 
φ : hom(FX,Y) ≅ hom(X,GY) natural en X ∈ *X* y en Y ∈ *Y*.  Decimos que F
es /adjunto izquierdo/ a G y que G es /adjunto derecho/ a F, y escribimos eso
como F ⊣ G.

Decir que φ es natural significa para cualquier h : X -> X' y para cualquier
k : Y -> Y', los siguientes cuadrados conmutan.  Como además φ es una biyección,
podemos tomar φ⁻¹, darle la vuelta a las flechas, y seguir teniendo cuadrados
que conmutan.
#+BEGIN_SRC haskell
  hom(FX, Y)  -{φ}->  hom(X, GY)     hom(FX, Y)  -{φ}->  hom(X, GY)   
    |                   |              |                   |          
  {_∘Fh}              {_∘h}          {k∘_}              {Gk∘_}        
    ↓                   ↓              ↓                   ↓          
  hom(FX',Y) -{φ}->  hom(X',GY)      hom(FX,Y') -{φ}->  hom(X,GY')    
#+END_SRC

*Notación de Lawvere.* Una notación más sencilla para condensar toda
esta información es usando diagramas que simulan relaciones
lógicas. Aprendí esta notación en /Use of logical operators in Mathematics/,
unas notas de William Lawvere que me recomendó [[https://wpd.ugr.es/~bullejos/wordpress/][Manuel Bullejos]]. 
No he podido trazar cuál es el origen exacto, parece que es "folklore"
en teoría de categorías.

Una adjunción F ⊣ G puede escribirse como sigue.
#+BEGIN_SRC haskell
    F X -{f}-> Y
  ──────────────────
    X -{φ(f)}-> G Y
#+END_SRC

Esta notación enfatiza que a cada morfismo FX -> Y le corresponde un
morfismo X -> GY; y que esta es una relación biyectiva, yendo en ambas
direcciones.  La naturalidad se traduce en que la precomposición y la
poscomposición de morfismos son respetados por esta regla de inferencia.
Dados cualesquiera h : X' -> X y k : Y -> Y', sabemos por naturalidad
que las flechas compuestas en los siguientes diagramas son adjuntas entre
sí.

#+BEGIN_SRC haskell
    F X' -{Fh}-> F X -{f}-> Y        F X -{f}-> Y -{k}-> Y'
  ─────────────────────────────  ──────────────────────────────
    X' -{h}-> X -{φ(f)}-> G Y      X -{φ(f)}-> G Y -{Gk}-> G Y'
#+END_SRC

Es decir, φ(f) ∘ h = φ(f ∘ Fh) y Gk ∘ φ(f) = φ(k ∘ f).

*Definición.* Dada una adjunción F ⊣ G, la *unidad* y la *counidad* son las
familias de morfismos η : X -> GFX y ε : FGY -> Y, que se obtienen al
aplicar el isomorfismo a las identidades.

#+BEGIN_SRC haskell
    F X -{id}-> F X      F G Y -{ε}-> Y  
  ───────────────────   ───────────────────
     X -{η}-> G F X       G Y -{id}-> G Y
#+END_SRC

*** Unidad y counidad son transformaciones naturales                             :noexport:ignore:
#+begin_proposicion
La unidad y la counidad son transformaciones naturales.
#+end_proposicion
#+begin_proof
Sean $h \colon X \to X'$ y $k \colon Y \to Y'$. Comprobaremos que el
morfismo adjunto a $Fh$ es $GFh \circ \eta_X$ y $\eta_X' \circ h$ al
mismo tiempo, lo que implica que deben ser iguales. De
la misma forma, el adjunto a $Gk$ es $k \circ \varepsilon_Y$ pero
tambień $\varepsilon_{Y'} \circ FGk$.
\begin{prooftree}
\AXC{\begin{tikzcd}[fragile,ampersand replacement=\&] 
\phantom{Fx}\&
X \rar{h}\& 
Y \rar{\eta}\& 
GFY
\end{tikzcd}}
\UIC{\begin{tikzcd}[fragile,ampersand replacement=\&] 
FX \rar{\id}\& 
FX \rar{Fh}\& 
FY \rar{\id}\& 
FY 
\end{tikzcd}}
\UIC{\begin{tikzcd}[fragile,ampersand replacement=\&]
X \rar{\eta}\& 
GFX \rar{GFh}\&
GFY \&
\phantom{Gy}
\end{tikzcd}}
\AXC{\begin{tikzcd}[fragile,ampersand replacement=\&] 
FGX \rar{\varepsilon} \&
X \rar{k}\& 
Y \& 
\phantom{GFy}
\end{tikzcd}}
\UIC{\begin{tikzcd}[fragile,ampersand replacement=\&]
GX \rar{\id}\&
GX \rar{Gk}\&
GY \rar{\id} \&
GY
\end{tikzcd}}
\UIC{\begin{tikzcd}[fragile,ampersand replacement=\&]
\phantom{Gx}\&
FGx \rar{FGk}\&
FGy \rar{\varepsilon}\&
y \end{tikzcd}}
\noLine
\BIC{}
\end{prooftree}
#+end_proof

