sobreadjunciones.html

<div id="outline-container-org3342258" class="outline-2">
<h2 id="org3342258"><span class="section-number-2">1</span> Adjunciones</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Definición.</b> Una <b>adjunción</b> entre dos categorías <b>X</b> e <b>Y</b> es un par de
funtores F : <b>X</b> -&gt; <b>Y</b> y G : <b>Y</b> -&gt; <b>X</b>, junto a una biyección 
φ : hom(FX,Y) ≅ hom(X,GY) natural en X ∈ <b>X</b> y en Y ∈ <b>Y</b>.  Decimos que F
es <i>adjunto izquierdo</i> a G y que G es <i>adjunto derecho</i> a F, y escribimos eso
como F ⊣ G.
</p>

<p>
Decir que φ es natural significa para cualquier h : X -&gt; X' y para cualquier
k : Y -&gt; Y', los siguientes cuadrados conmutan.  Como además φ es una biyección,
podemos tomar φ⁻¹, darle la vuelta a las flechas, y seguir teniendo cuadrados
que conmutan.
</p>
<div class="org-src-container">
<pre class="src src-haskell">  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FX</span>, <span style="color: #ce537a; font-weight: bold;">Y</span><span style="color: #4f97d7;">)</span>  <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span>  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">X</span>, <span style="color: #ce537a; font-weight: bold;">GY</span><span style="color: #4f97d7;">)</span>     hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FX</span>, <span style="color: #ce537a; font-weight: bold;">Y</span><span style="color: #4f97d7;">)</span>  <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span>  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">X</span>, <span style="color: #ce537a; font-weight: bold;">GY</span><span style="color: #4f97d7;">)</span>   
    <span style="color: #7590db;">|</span>                   <span style="color: #7590db;">|</span>              <span style="color: #7590db;">|</span>                   <span style="color: #7590db;">|</span>          
  <span style="color: #4f97d7;">{</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #7590db;">&#8728;</span><span style="color: #ce537a; font-weight: bold;">Fh</span><span style="color: #4f97d7;">}</span>              <span style="color: #4f97d7;">{</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #7590db;">&#8728;</span>h<span style="color: #4f97d7;">}</span>          <span style="color: #4f97d7;">{</span>k<span style="color: #7590db;">&#8728;</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #4f97d7;">}</span>              <span style="color: #4f97d7;">{</span><span style="color: #ce537a; font-weight: bold;">Gk</span><span style="color: #7590db;">&#8728;</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #4f97d7;">}</span>        
    <span style="color: #7590db;">&#8595;</span>                   <span style="color: #7590db;">&#8595;</span>              <span style="color: #7590db;">&#8595;</span>                   <span style="color: #7590db;">&#8595;</span>          
  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FX'</span>,<span style="color: #ce537a; font-weight: bold;">Y</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span>  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">X'</span>,<span style="color: #ce537a; font-weight: bold;">GY</span><span style="color: #4f97d7;">)</span>      hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FX</span>,<span style="color: #ce537a; font-weight: bold;">Y'</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span>  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">X</span>,<span style="color: #ce537a; font-weight: bold;">GY'</span><span style="color: #4f97d7;">)</span>    
</pre>
</div>

<p>
<b>Notación de Lawvere.</b> Una notación más sencilla para condensar toda
esta información es usando diagramas que simulan relaciones
lógicas. Aprendí esta notación en <i>Use of logical operators in Mathematics</i>,
unas notas de William Lawvere que me recomendó <a href="https://wpd.ugr.es/~bullejos/wordpress/">Manuel Bullejos</a>. 
No he podido trazar cuál es el origen exacto, parece que es "folklore"
en teoría de categorías.
</p>

<p>
Una adjunción F ⊣ G puede escribirse como sigue.
</p>
<div class="org-src-container">
<pre class="src src-haskell">    <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>f<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Y</span>
  <span style="color: #7590db;">&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;</span>
    <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #bc6ec5;">(</span>f<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y</span>
</pre>
</div>

<p>
Esta notación enfatiza que a cada morfismo FX -&gt; Y le corresponde un
morfismo X -&gt; GY; y que esta es una relación biyectiva, yendo en ambas
direcciones.  La naturalidad se traduce en que la precomposición y la
poscomposición de morfismos son respetados por esta regla de inferencia.
Dados cualesquiera h : X' -&gt; X y k : Y -&gt; Y', sabemos por naturalidad
que las flechas compuestas en los siguientes diagramas son adjuntas entre
sí.
</p>

<div class="org-src-container">
<pre class="src src-haskell">    <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X'</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span><span style="color: #ce537a; font-weight: bold;">Fh</span><span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>f<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Y</span>        <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>f<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Y</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>k<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Y'</span>
  <span style="color: #7590db;">&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;</span>  <span style="color: #7590db;">&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;</span>
    <span style="color: #ce537a; font-weight: bold;">X'</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>h<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #bc6ec5;">(</span>f<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y</span>      <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#966;<span style="color: #bc6ec5;">(</span>f<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span><span style="color: #ce537a; font-weight: bold;">Gk</span><span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y'</span>
</pre>
</div>

<p>
Es decir, φ(f) ∘ h = φ(f ∘ Fh) y Gk ∘ φ(f) = φ(k ∘ f).
</p>

<p>
<b>Definición.</b> Dada una adjunción F ⊣ G, la <b>unidad</b> y la <b>counidad</b> son las
familias de morfismos η : X -&gt; GFX y ε : FGY -&gt; Y, que se obtienen al
aplicar el isomorfismo a las identidades.
</p>

<div class="org-src-container">
<pre class="src src-haskell">    <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>id<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X</span>      <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#949;<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Y</span>  
  <span style="color: #7590db;">&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;</span>   <span style="color: #7590db;">&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;</span>
     <span style="color: #ce537a; font-weight: bold;">X</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>&#951;<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">F</span> <span style="color: #ce537a; font-weight: bold;">X</span>       <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y</span> <span style="color: #7590db;">-</span><span style="color: #4f97d7;">{</span>id<span style="color: #4f97d7;">}</span><span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">G</span> <span style="color: #ce537a; font-weight: bold;">Y</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 21 de abril de 2019. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
